;---------------------------------BEGIN: EMCC\Caliset-----------------------------------------
[CALISET_DLG_102]
CAPTION= HL Correction Software
ID1022 = set ng solusyon
ID1023 = Mangyaring piliin ang:
ID1007 = I -save ang isa pa bilang
ID1017 = Tanggalin
ID1084 = import
ID1085 = I -export

ID1075 = Tamang header
ID1024 = pangunahing mga parameter
ID1025 = saklaw ng rate (mm):
ID1026 = Marking Range (mm):
ID1072 = Coordinate System
ID1077 = anggulo ng umiikot
ID1079 = X Offset (mm)
ID1080 = y offset (mm)
ID1119 = Vibration Mirror 1 = x
ID1120 = Vibration Mirror 2 = x
ID1116 = baligtad
ID1117 = baligtad

ID1030 = Pagwawasto ng Grid at Antas (Double -Click upang i -pop up ang awtomatikong window ng pagkalkula pagkatapos piliin ang ratio ng zoom)
ID1009 = Magdagdag ng antas
ID1010 = Tanggalin ang antas
ID1012 = multi -level pangkalahatang epekto
ID1031 = Bumalik sa antas ng salita:
ID1018 = Pinakamataas na antas ng graph ng text graph

ID1053 = Red Guang Correction
ID1043 = Paganahin
ID1054 = X Astability Ratio:
ID1055 = Y Zoom Ratio:
ID1056 = x Pag -aalis (mm):
ID1057 = Y Deviation (mm):

ID1058 = Pokus
ID1065 = Pamamaraan sa pagtuon
ID1059 = Dynamic na uri ng pokus
ID1060 = Control mode
ID1061 = spacing ng isang baras (mm)
ID1082 = fangtou sa taas ng eroplano na nagtatrabaho (mm)
ID1063 = Fine -tuning Halaga (UM)
ID1062 = koepisyent ng pokus na pokus

ID1011 = Pagsubok F7
ID1037 = Tumigil
ID1014 = Parameter >>

ID1109 = tamang uri
ID1099 = ordinaryong pagwawasto
ID1100 = Mataas -Pagwawasto ng Correction 1 [Scanner]
ID1101 = Mataas -Pagwawasto
ID1110=Instruksyon para sa pag-aayos ng mataas na precision: 1. Una, piliin ang regular na pag-aayos para sa karaniwang pag-aayos, at gumawa ng unang pag-aayos sa coordinate system, pag-aayos ng pulang liwanag, sukat ng BOX at pag-aayos. 2. Piliin ang koreksyon ng mataas na precision upang lumikha ng mga punto sa grid. 3. Pagkatapos ng pagkuha at pagproseso ng mga datos gamit ang iba't ibang mga kagamitan, i-import ang mga datos.
ID1114=Direktang i-import ang mga datos tungkol sa pag-aayos ng mataas na precision

ID1089 = Mataas -Pagwawasto ng Pagwawasto
ID1086 = Bumuo ng punto ng grid
ID1111 = Unang Hakbang: Bumuo ng punto ng grid.
ID1112 = Hakbang 2: Ipakilala ang tunay na data ng coordinate na sinusukat ng scanner o dalawang -dimensional na pagsukat.
ID1113 = Hakbang 3: Lumikha ng isang mataas na talahanayan ng pagwawasto ng pag -aayos at kumpirmahin ang exit ng pangangalaga.

ID1096 = Scaling
ID1027 = High -Precision Marking Range (mm)
ID1097 = paga
ID1028 = laki ng kahon ng pagsubok (mm):
ID1091 = I -import ang data pagkatapos ng pagproseso ng scanner
ID1087 = I -import ang data
ID1016 = Lumikha ng isang talahanayan ng Pagwawasto ng Mataas -Precision
ID1139=Ipaglikha ng talahanayan ng pag-aayos
ID1 = ok
ID2 = Kanselahin
ID1142=Marking Control

[CALISET_DLG_167]
CAPTION = mataas na -precision data import
ID1114 = x Coordinate file na nakuha ng pangalawang sukat:
ID1115 = y coordinate file na nakuha ng pangalawang sukat:
ID1 = ok
ID2 = Kanselahin

[CALISET_DLG_159]
CAPTION = i -save ang solusyon
ID1036 = Ang pagwawasto ng scheme ay naka -imbak nang hiwalay:
ID1 = ok
ID2 = Kanselahin

[CALISET_DLG_131]
CAPTION = pagmamarka ng parameter
ID1032 = Bilang ng mga oras ng pagmamarka:
ID1033 = bilis ng pagmamarka (mm/s)
ID1035 = kapangyarihan (%)
ID1034 = Q Frequency (kHz)
ID1036 = oras ng paglabas ng q (US)
ID1037 = laser turbide latency (US)
ID1 = ok
ID2 = Kanselahin

[CALISET_DLG_160]
CAPTION = pagtatakda ng impormasyon sa label ng label
ID1093 = Bilang ng mga hilera
ID1094 = numero ng haligi
ID1116 = Itakda lamang ang bilang ng mga ranggo, hindi minarkahan
ID1 = pagmamarka
ID2 = Kanselahin
ID1099=Point
ID1100=Cross
ID1101=Circle

[CALISET_DLG_164]
CAPTION = piliin ang control card
ID1098 = Mangyaring pumili ng isang nagtatrabaho card:
ID1 = ok
ID2 = Kanselahin

[CALISET_STRINGTABLE]
ID0 = laki ng kahon (mm)
ID1 = X Zoom Ratio % %
ID2 = y zoom ratio % %
ID3 = x BUMPY
ID4 = y paga
ID5 = x Trapezoidal
ID6 = y trapezoidal
ID7 = x Parallel
ID8 = y kahanay
ID9 = x positibong proporsyon % %
ID10 = x negatibong ratio % % %
ID11 = y positibong proporsyon % %
ID12 = y negatibong proporsyon % %
ID13 = antas ng parameter
ID14 = kasalukuyang (a)
ID15 = Power (%)
ID16 = kasalukuyang (%)
ID17 = Laser Pulse Width (NS)
ID18 = Laser mode
ID999 = Mayroon nang isang marking software o software sa pagwawasto ay tumatakbo, mangyaring isara muna ito!
ID1000 = nawala o pinsala sa benchmarking file, mangyaring kumpirmahin kung normal ang software!
ID1001 = Nabigo ang pagsisimula ng marking control card!
ID1002 = nabigo ang mga setting ng system ng control card!
ID1003 = Mangyaring piliin ang antas ng pagwawasto na nais mong subukan muna!
ID1004 = Nabigo ang operasyon, mangyaring subukan ito mamaya!
ID1005 = Mayroon bang isang pangalan ng scheme na mayroon na?
ID1006 = Ang saklaw ng pagwawasto ay hindi maaaring maging 0!
ID1007 = Ang saklaw ng pagmamarka ay hindi maaaring 0!
ID1008 = Ang proporsyonal na koepisyent ng saklaw ng pagwawasto at ang saklaw ng pagmamarka ay hindi tama.
ID1011 = Mangyaring piliin ang antas upang tanggalin ang antas
ID1012 = Mangyaring panatilihin ang hindi bababa sa unang -level na pagwawasto!
ID1013 = error sa file!
ID1014 = Itakda ang data ng pagwawasto sa card na mabigo, mangyaring subukan ito mamaya!
ID1015 = Ang scheme ng pagsasaayos ng pagwawasto na ito ay hindi naaayon sa kasalukuyang bersyon ng software. Pinipilit bang basahin?
ID1016 = Ang laki ng kahon ay hindi maaaring lumampas sa saklaw ng pagmamarka!
ID1017 = Ang laki ng kahon ay hindi maaaring lumampas sa laki ng nakaraang antas!
ID1018 = Nabago ang kasalukuyang mga setting ng pagwawasto, nakaimbak ba ito?
ID1019 = Nabigo ang pagbabasa ng file!
ID1020 = Kumpirma ang pagtanggal ng kasalukuyang scheme?
ID1021 = Ang mga aso ng software ay hindi napansin!
ID1022 = Ang mga aso ng software ay napansin, ngunit hindi ligal na mga aso ng software!
ID1023 = Mayroong higit sa 1 ligal na software na nakapasok!
ID1024 = I -convert ang paunang aso sa pagpapatakbo ng isang aso ay nabigo!
ID1025 = "Nag -expire na ang kasalukuyang pahintulot ng software, at kailangan mong makipag -ugnay sa kawani ng serbisyo sa customer upang muling maging para sa patch ng lisensya kasama ang (dog ID =%s, verification code =%s)
ID1026 = "D160"
ID1027 = "D480"
ID1028 = "CO2 Enhance"
ID1029 = "tradisyon ng CO2"
ID1030 = "Nabigo" ang paglulunsad "
ID1031 = Ang laki ng kahon ay hindi maaaring maging mas maliit kaysa sa susunod na antas!
ID1032 = Higit pa sa mabisang lugar ng pagwawasto
ID1033 = "Farth Focus"
ID1034 = "3D Dynamic Coking"
ID1035 = "Ordinaryong Back Focus"
ID1036 = "Simple Laser Control Mode ay dapat na mas maliit kaysa sa Marking Range%DMM" "
ID1037 = "Kunin ang Dog ID na naka -imbak sa card na nabigo, mangyaring suriin kung ang card ay nakasalalay na nakatali"
ID1038 = "I -import ang FAIL"
ID1039 = "Pag -import ng Tagumpay"
ID1040 = "Nabigo ang pag -export"
ID1041 = "Tagumpay sa Pag -export"
ID1042 = "Nabigo ang Operation
ID1043 = "Ang data ng file ay hindi tumutugma"
ID1044 = "Focus 3D" pagkatapos "
ID1045 = "X Coordinate File path ay walang laman!"
ID1046 = "Y Coordinate File path ay walang laman!"
ID1047 = "Ang aso sa card ay hindi naaayon sa naka -encrypt na numero ng aso"
ID1048 = "Ang numero ng card sa card ay walang laman o ang haba ay hindi tama" "

;---------------------------------End: EMCC\Caliset-----------------------------------------

[error]
1=Hindi inisyal ang card o hindi natagpuan ang card!
2 = Nabigo ang pag-reset!
3 = Hindi tama ang bersyon ng card!
4 = Alarm!
6=Nabigo ang pagpapatupad!
7=Hindi tumutugma ang katayuan!
16=Nag-time out ang command!
17=Nawala ang utos!
18=Interface tawag asynchronous!
19=Interface na inookupahan ng ibang programa!
20 = Z axis overrun o pagwawasto ng file katiwalian!
21=Hindi pagkakatugma ng Parameter!
23=Nabigo ang alokasyon ng memorya!
100 = Offline na paggamit!
101=Ipinalaglag ang utos!
1001=Port 1
1002=Port 2
1003=Port 3
1004=Daungan 4
1005=Daungan 5
1006=Port 6
1007=Daungan 7
1008 = Hindi handa ang input ng Laser
1009 = Handa na ang input ng laser

[4]
1 = Laser overtemperature, patayin ang kuryente!
2 = Laser mataas na anti-alarma, mangyaring patayin ang kapangyarihan!
3 = Laser MO abnormal, mangyaring patayin ang kapangyarihan!
4 = Ang takip ng laser ay bukas, mangyaring patayin ang kapangyarihan at i-install ang laser cover!
5 = Ang pinto ng kaligtasan ay binuksan, mangyaring isara ito!
6 = Ang shutter ay sarado nang hindi normal, mangyaring patayin ang kapangyarihan at suriin ang shutter!
7 = Ang shutter ay hindi bukas nang hindi normal, mangyaring patayin ang kapangyarihan at suriin ang shutter!
8 = Ang pinto ng kaligtasan ay binuksan, ang pagmamarka ay pansamantalang natigil, mangyaring isara ang pinto ng kaligtasan upang magpatuloy sa pagmamarka!
9 = Binuksan ang gate ng kaligtasan, pinalaglag ang pagmamarka!
10= Laser system alarm, mangyaring patayin ang kapangyarihan!
11= Laser supply boltahe sa labas ng saklaw, mangyaring patayin ang kapangyarihan!
12= Laser power supply overvoltage alarm, mangyaring patayin ang kapangyarihan at suriin ang laser kapangyarihan!
13= Laser power supply undervoltage alarm, mangyaring patayin ang kapangyarihan at suriin ang laser kapangyarihan!
14 = SPI laser overtemperature alarm, mangyaring patayin ang kapangyarihan!
15= SPI laser handa amplifier overcurrent alarm, mangyaring patayin ang kapangyarihan!
16= SPI laser power amplifier overcurrent alarm, mangyaring patayin ang kapangyarihan!
17= SPI laser banggaan laser alarma, mangyaring patayin ang kapangyarihan!
18= SPI laser pagpapanatili alarma, mangyaring patayin ang kapangyarihan!
19= SPI laser power alarm, mangyaring patayin ang kapangyarihan!
20= Laser unknown alarm, mangyaring patayin ang kapangyarihan!
21= Laser power overcurrent alarm, mangyaring patayin ang kuryente!
22= Laser kapangyarihan overvoltage alarm, mangyaring patayin ang kapangyarihan!
23= Laser kapangyarihan overtemperature alarm, mangyaring patayin ang kapangyarihan at suriin ang mga kondisyon ng pagwawaldas ng init!
24= Hindi naka on ang laser power, paki check ang power supply.
30= Negatibong limitasyon ay nakatagpo sa panahon ng paggalaw, pagmamarka ay aborted!
31= Kapag may positibong limitasyon sa paggalaw, ipagpapalaglag ang pagmamarka!
32= Motor pulse sa labas ng saklaw
33= Galvanometer DA sa labas ng saklaw!
34= Platform X-axis Super Positibong Limitasyon!
35= Platform X-axis labis na negatibong limitasyon!
36= Platform Y-axis sobrang positibong limitasyon!
37= Platform Y-axis labis na negatibong limitasyon!
38= Galvanometer square head ay pinapatakbo abnormally, mangyaring patayin ang kapangyarihan at suriin!
54=Maaari lamang lumipat sa 512 correction table!
55=Maaari lamang lumipat sa 128 koreksyon talahanayan!
100 = Ang safety gate ay may bisa at bukas!

110 = Pindutin ang isang negatibong limitasyon!
111 = pindutin ang isang positibong limitasyon!
112 = Pindutin ang pinagmulan sa paggalaw!
500 = Galvanometer warming up, mangyaring subukang muli mamaya!

[door]
1=Ang pinto ng kaligtasan ay binuksan, mangyaring isara ang pinto ng seguridad!
2=Ang pinto ng kaligtasan ay binuksan, ang pagmamarka ay i pause, mangyaring isara ang pinto ng kaligtasan upang magpatuloy sa pagmamarka!
3 = Ang pinto ng seguridad ay binuksan, ang pagmamarka ay pinalaglag!
4 = Ang pinto ng kaligtasan ay sarado, maaari mong patuloy na markahan!
5=Ang pinto ng kaligtasan ay sarado at ang katayuan ay normal!
6=Negatibong limitasyon ay nakatagpo sa panahon ng ehersisyo, pagmamarka ay aborted!
7 = Ang positibong limitasyon ay nakatagpo sa panahon ng paggalaw, at ang pagmamarka ay inilaglag! 
[usb]
1=EMCC card nakakonekta na
2=Nadisconnect na ang EMCC card

[4101]
3 = DA card 1 function at bersyon ng impormasyon
4=DA card 1 bersyon impormasyon ng petsa
5 = Lumipas na oras ng DA card 1
7 = bilang ng mga error frame para sa DA card 1
9 = DA card 1 countdown sa oras ng error ng 4th bit
11 = DA card 1 countdown oras para sa 3rd bit error
13 = DA card 1 countdown ang oras ng error ng 2nd bit
15 = Oras ng huling bit error sa DA card 1

[4102]
4 = Bilang ng mga frame na wala sa code ng DA card 1
6 = DA card 1 countdown ang oras ng 4th miss
8 = DA card 1 countdown ang oras ng 3rd missed code
10 = DA card 1 countdown ang oras ng pangalawang nawawalang code
12 = DA card 1 huling hindi nakuha ang oras
14 = DA card 1 galvanometer alarma impormasyon
15 = DA card 1 galvanometer alarma off laser paganahin

[4103]
3 = DA card 2 function at bersyon ng impormasyon
4=DA card 2 bersyon impormasyon ng petsa
5 = Lumipas na oras ng DA card 2
7 = Bilang ng mga error frame para sa DA card 2
9 = DA card 2 countdown oras para sa 4th bit error
11 = DA card 2 countdown oras para sa 3rd bit error
13 = DA card 2 countdown ang oras ng pangalawang bit error
15 = oras ng huling bit error sa DA card 2

[4104]
4 = ang bilang ng mga out of code na frame ng DA card 2
6 = DA card 2 countdown ang oras ng 4th miss
8 = DA card 2 countdown ang oras ng ikatlong miss
10 = DA card 2 penultimate pagkawala ng oras
12 = ang panahon kung kailan huling hindi nakuha ang DA card 2
14=DA card 2 galvanometer alarma impormasyon
15 = DA card 2 galvanometer alarma off laser paganahin

[4105]
3 = LASER card function at bersyon ng impormasyon
4=LASER card bersyon ng petsa ng impormasyon
5 = LUMIPAS NA ORAS NG LASER CARD
7 = ANG BILANG NG MGA FRAME NG ERROR PARA SA LASER CARD
9 = Oras ng penultimate bit error ng LASER card
11 = Oras ng penultimate bit error ng LASER card
13 = Oras upang mabilang pababa sa 2nd bit error ng LASER card
15 = Oras ng huling bit error sa LASER card

[4106]
4 = ANG BILANG NG MGA HINDI NAKUHA NA MGA FRAME NG LASER CARD
6 = Ang oras kung kailan nawala ang LASER card nito code para sa 4th countdown
8 = Ang oras kapag ang LASER card ay nawala ang code para sa 3rd countdown
10 = Ang oras kapag ang LASER card ay nawawala ang code para sa pangalawang penultimate time
12 = LASER card huling hindi nakuha ang code
14 = LASER galvanometer mensahe ng alarma
15 = LASER card laser alarma off laser paganahin

[4107]
3= LASER card laser kasalukuyang ns waveform
4 = LASER card laser kasalukuyang ps waveform
5 = LASER card laser kasalukuyang fs waveform
6 = LASER card laser kasalukuyang nagpapanatili ng kapangyarihan

[4102Warning]
0 = D0: Abnormal ang komunikasyon ng data ng DA card 1
1 = D1: DA card 1 Alarma ng system ng scanner
2 = D2: DA card 1 Alarma ng temperatura ng scanner
3 = D3: DA card 1 Scanner mababang bilis ng alarma
4=D4: Hindi nagamit
5=D5: Hindi nagamit
6=D6: Hindi nagamit
7=D7: Hindi nagamit
8=D8: Hindi ginamit
9=D9: Hindi ginamit
10=D10: Hindi ginagamit
11=D11: Hindi ginagamit
12=D12: Hindi ginagamit
13=D13: Hindi ginamit
14=D14: Hindi ginamit
15 = D15: EMCC card Data komunikasyon abnormal

[4104Warning]
0 = D0: Data komunikasyon ng DA card 2 abnormal
1 = D1: Alarma ng sistema ng DA Card 2 Scanner
2 = D2: DA card 2 Alarma ng temperatura ng scanner
3 = D3: DA card 2 Scanner mababang bilis ng alarma
4=D4: Hindi nagamit
5=D5: Hindi nagamit
6=D6: Hindi nagamit
7=D7: Hindi nagamit
8=D8: Hindi ginamit
9=D9: Hindi ginamit
10=D10: Hindi ginagamit
11=D11: Hindi ginagamit
12=D12: Hindi ginagamit
13=D13: Hindi ginamit
14=D14: Hindi ginamit
15=D15: Hindi ginagamit

[4106Warning]
0 = D0: LASER card data komunikasyon abnormal
1=D1: Laser temperatura alarma
2=D2: Power alarm
3=D3: Alarma ng sistema
4=D4: Mataas na anti alarma
5=D5: Hindi pa handa ang laser
6=D6: Nabigo ang pag aapoy ng binhi ng laser
7 = D7: Binhi laser temperatura alarma
8 = D8: MO overcurrent alarma
9=D9: PA overcurrent alarm
10=D10: Alarma ng Collimator
11=D11: Hawakan ang alarma 5
12=D12: Hawakan ang alarma 4
13=D13: Hawakan ang alarma 3
14=D14: Hawakan ang alarma 2
15=D15: Hawakan ang alarma 1

[Refresh]
Interval=500





